# data-database-types-relational-language-SQL-MySQL-C_R_UD-read-command-SELECT
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **command** - SELECT - is the **workhorse** of - **sql** - during a databases lifecycle a small portion of the lifecycle will be setting up the database - once set up the relational database - schema - will remain static or unchanged - from when the database is set to when it becomes obsolete [1]

- **used** for - **adding** - **updating** - **deleting** - as well as getting information from the database to enable the user learn more about the business - sales this week/quarter/year - new subscribed customers - **almost** **all** the **information** **obtained** from a database is **via** the command - **SELECT** [1]

> [SQL DOCUMENTATION](https://web.archive.org/web/20200706074647/https://dev.mysql.com/doc/refman/8.0/en/select.html)

- SELECT - command - **select** column/**columns** - attributes - fields from **table** - entity - relation [1]

```sql
SELECT <columns>
FROM <table>;
```

- obtain all - * - columns - attributes - fields - from table - entity - relation [1]

```sql
mysql> -- lab1 - person
mysql> SELECT *
    -> FROM person;
+----------+-------+------+------+------------+-----------+
| personID | name  | age  | sex  | dob        | isStudent |
+----------+-------+------+------+------------+-----------+
|        1 | John  |   23 | M    | 2000-01-01 |         1 |
|        2 | Tom   |   64 | M    | 1958-03-11 |         0 |
|        3 | Mary  |   12 | F    | 2005-04-11 |         1 |
|        4 | Alan  |   12 | M    | 2005-11-21 |         1 |
|        5 | Pat   |   29 | M    | 1993-03-17 |         0 |
|        6 | Shane |   40 | M    | 1988-07-21 |         0 |
|        7 | Shane |   14 | M    | 2003-06-01 |         1 |
|        8 | Alice |   24 | F    | 1999-03-01 |         1 |
|        9 | Pat   |   37 | F    | 1988-04-15 |         0 |
+----------+-------+------+------+------------+-----------+
9 rows in set (0.00 sec)
```

- obtain column - attribute - field - name - from table - entity - relation - person [1]

```sql
mysql> -- lab1 - person
mysql> SELECT name
    -> FROM person;
+-------+
| name  |
+-------+
| John  |
| Tom   |
| Mary  |
| Alan  |
| Pat   |
| Shane |
| Shane |
| Alice |
| Pat   |
+-------+
9 rows in set (0.00 sec)
```

- obtain columns - attributes - fields - name - age - from table - entity - relation - person [1]

```sql
mysql> -- lab1 - person
mysql> SELECT name,age
    -> FROM person;
+-------+------+
| name  | age  |
+-------+------+
| John  |   23 |
| Tom   |   64 |
| Mary  |   12 |
| Alan  |   12 |
| Pat   |   29 |
| Shane |   40 |
| Shane |   14 |
| Alice |   24 |
| Pat   |   37 |
+-------+------+
9 rows in set (0.00 sec)
```

***
# END